ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 15,
    center: [55.650762, 37.460527],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.

      [55.64723916, 37.46332026],
      [55.6470526, 37.46199793],
      [55.64694444, 37.46150036],
      [55.64672777, 37.46069638],
      [55.64669831, 37.46060016],
      [55.64653233, 37.460284],
      [55.64635032, 37.45960808],
      [55.64613948, 37.45910114],
      [55.64609549, 37.45899654],
      [55.64602116, 37.45872564],
      [55.64591792, 37.45836547],
      [55.64575986, 37.45792789],
      [55.64566601, 37.45739103],
      [55.64556979, 37.45707941],
      [55.64556111, 37.45703562],
      [55.64556891, 37.45698889],
      [55.64558494, 37.45695531],
      [55.64573782, 37.45681338],
      [55.64588441, 37.45668924],
      [55.64616415, 37.45646086],
      [55.6467661, 37.45576257],
      [55.6466477, 37.45563142],
      [55.64663137, 37.45561775],
      [55.64661562, 37.4555975],
      [55.64655437, 37.45545923],
      [55.64652203, 37.45544586],
      [55.64650833, 37.45543079],
      [55.64649465, 37.45536022],
      [55.64648097, 37.45533525],
      [55.64645498, 37.4552857],
      [55.64646882, 37.4551469],
      [55.64647962, 37.45515025],
      [55.64652266, 37.45523005],
      [55.64653045, 37.45524161],
      [55.64658895, 37.45526458],
      [55.64658786, 37.45534157],
      [55.64657822, 37.45539674],
      [55.64655443, 37.45545917],
      [55.6466034, 37.45557098],
      [55.64661177, 37.45558827],
      [55.64661937, 37.45560278],
      [55.64667512, 37.45566166],
      [55.64676841, 37.45576188],
      [55.64694339, 37.45584763],
      [55.64708596, 37.45602465],
      [55.647164, 37.45602402],
      [55.64729326, 37.45597944],
      [55.64734736, 37.45597388],
      [55.6473964, 37.45599792],
      [55.64750548, 37.45617155],
      [55.64752665, 37.45619131],
      [55.64757513, 37.45620972],
      [55.64764167, 37.45618022],
      [55.64766272, 37.45619095],
      [55.64767846, 37.45621509],
      [55.64776368, 37.45647929],
      [55.64782084, 37.45656377],
      [55.64796561, 37.45662961],
      [55.64807334, 37.45668253],
      [55.64815756, 37.4566952],
      [55.64828375, 37.45671756],
      [55.64860355, 37.45677953],
      [55.64942129, 37.45679345],
      [55.64946118, 37.45681322],
      [55.6498088, 37.4573002],
      [55.64992323, 37.45756443],
      [55.65013716, 37.45787555],
      [55.65019427, 37.45791033],
      [55.65025137, 37.45792567],
      [55.65033338, 37.45799944],
      [55.65043884, 37.45810916],
      [55.6506586, 37.45843327],
      [55.65080923, 37.45812773],
      [55.65089695, 37.45787348],
      [55.65098316, 37.45760581],
      [55.65116764, 37.45764321],
      [55.65150309, 37.45775293],
      [55.65167509, 37.45780357],
      [55.65262564, 37.45797864],
      [55.65304367, 37.45805322],
      [55.65349408, 37.45808233],
      [55.65395489, 37.4580524],
      [55.65423848, 37.45801485],
      [55.65447582, 37.45799339],
      [55.65450463, 37.45803363],
      [55.65451948, 37.45813111],
      [55.65451714, 37.45841584],
      [55.65445421, 37.45880342],
      [55.65440218, 37.45904454],
      [55.65434399, 37.45918119],
      [55.65428132, 37.45928622],
      [55.65426134, 37.45943397],
      [55.65423201, 37.45950187],
      [55.6542181, 37.45957897],
      [55.6541594, 37.45965604],

    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
      strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 2,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [55.64723916, 37.46332026],
    {
      hintContent: "Начало экотропы",
      //   balloonContent: `Начало маршрута`,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [55.6541594, 37.45965604],
    {
      hintContent: "Конец экотропы",
      //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
