ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 14,
    center: [55.8035803422638,37.6718915729995],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  // Тропа здоровья Сокольники

  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
        [55.7917890322544,37.6650575360331],
[55.792115440396,37.6648858746561],
[55.7922907325235,37.6647571286234],
[55.7927622039697,37.6639095505747],
[55.7934210454926,37.6629332264933],
[55.7937370124678,37.6624663659333],
[55.7939485629878,37.6620908566712],
[55.7941057140556,37.6615973302125],
[55.7944371519822,37.6612253642851],
[55.7948568207933,37.6606347446963],
[55.796616853314,37.6611630139512],
[55.7973376966251,37.6618473831568],
[55.7986234852632,37.6622922229897],
[55.7990646623027,37.6624102401864],
[55.7992399230211,37.6625819015633],
[55.7995179211565,37.6623673248422],
[55.7999945514465,37.6627176948456],
[55.8000972881205,37.6628571697144],
[55.8002785874695,37.6637262054352],
[55.8005988809141,37.6639300533204],
[55.8009980977878,37.6644226403637],
[55.8017897469874,37.6650663705273],
[55.8020798128766,37.6656242700024],
[55.8023718654174,37.665643658067],
[55.8026981844906,37.6658796924604],
[55.8028250856107,37.6661586421979],
[55.8030728437432,37.6668452877057],
[55.8032964289915,37.6672744411481],
[55.8036287830586,37.668883766557],
[55.803713283259,37.6694239407058],
[55.8037314115412,37.6699067383285],
[55.8037253687814,37.6705611973282],
[55.8036709839009,37.6710869102951],
[55.8035984706082,37.671623352098],
[55.8035803422638,37.6718915729995],
[55.8036286844966,37.6722885399337],
[55.8038099673328,37.6728357105728],
[55.803930822086,37.6733185081955],
[55.8039549929914,37.673586729097],
[55.8039368648137,37.6738334923263],
[55.8038052468114,37.6741754241364],
[55.8034366374425,37.6752053923982],
[55.8033580808944,37.6755272574799],
[55.8033218239723,37.6757418342011],
[55.8033097383241,37.6761280722993],
[55.8032734813569,37.676449937381],
[55.8031405388536,37.6769434638398],
[55.803074067431,37.6772438712495],
[55.8030559388414,37.6775871940034],
[55.8031042817281,37.6779841609376],
[55.8032655757776,37.6783195202112],
[55.8033803894143,37.6787057583094],
[55.8032837042691,37.6789096061945],
[55.8031024189721,37.6790705387354],
[55.802878832605,37.6792743866205],
[55.8026371161629,37.6799073879481],
[55.8024713827531,37.6802769015728],
[55.8020967176881,37.6807704280315],
[55.8019456420407,37.6809313605724],
[55.8017160059294,37.6811244796215],
[55.8015770149907,37.6813712428509],
[55.8014319804364,37.6816931079327],
[55.8013292472989,37.6820900748669],
[55.8012265138892,37.6824012111126],
[55.8011177370411,37.6825514148174],
[55.8009424848104,37.682658703178],
[55.8006967214583,37.6827892033466],
[55.8005395970993,37.6828964917072],
[55.8003764288219,37.683035966576],
[55.800291822778,37.6832076279529],
[55.8002132598577,37.6833900181659],
     
    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
         strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [55.7917890322544,37.6650575360331],
    {
      hintContent: "Начало маршрута",
    //   balloonContent: `Начало маршрута Каменный столб `,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [55.8002132598577,37.6833900181659],
    {
      hintContent: "Конец маршрута",
    //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
