ymaps.ready(function () {
    var myMap = new ymaps.Map("map", {
        zoom: 16,
        center: [55.708492, 37.565603],
        controls: [],
    });
    myMap.controls.add("geolocationControl", {
        float: "none",
        position: {
            top: "16px",
            left: "16px",
        },
    });
    myMap.controls.add("zoomControl", {
        float: "none",
        position: {
            top: "250px",
            right: "15px",
        },
    });
    myMap.controls.add("typeSelector", {
        float: "none",
        position: {
            top: "16px",
            left: "64px",
        },
    });

    // Трэк  

    var myPolyline = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [55.70801509, 37.56007626],
            [55.70804008, 37.56133488],
            [55.70808572, 37.56175627],
            [55.70813132, 37.5620631],
            [55.70816161, 37.56225756],
            [55.70820667, 37.56243727],
            [55.70823468, 37.56275109],
            [55.70822976, 37.56286978],
            [55.70822563, 37.56309503],
            [55.70823519, 37.56348261],
            [55.70824415, 37.56371937],
            [55.70825929, 37.56412639],
            [55.7084077, 37.56435371],
            [55.70842209, 37.56439461],
            [55.70846222, 37.56468228],
            [55.70852734, 37.56490893],
            [55.70857164, 37.56539172],
            [55.70858564, 37.56544134],
            [55.70877494, 37.5658021],
            [55.70891351, 37.56620711],
            [55.70911492, 37.56669796],
            [55.70920048, 37.56690784],
            [55.70925879, 37.56718009],
            [55.70932504, 37.56748921],
            [55.7094053, 37.56785734],
            [55.70951661, 37.56837233],
            [55.7095768, 37.56864725],
            [55.70968319, 37.56905093],
            [55.709736, 37.56924539],
            [55.7097873, 37.56940096],
            [55.7098986, 37.56972886],
            [55.7100065, 37.569869],
            [55.7101284, 37.56994276],
            [55.71011099, 37.5701285],
            [55.71022684, 37.57076084],
            [55.7103476, 37.57142066],
            [55.71042976, 37.5717908],
            [55.71045815, 37.57191419],
            [55.71053538, 37.57217101],
            [55.71081466, 37.57214994],
            [55.71083037, 37.57212178],
            [55.71094629, 37.57199287],
            [55.71099967, 37.57193185],
            [55.71105116, 37.57187485],
            [55.71106516, 37.571844],
            [55.71106592, 37.57181115],
            [55.71089329, 37.57118351],
            [55.71060481, 37.57012203],
            [55.71055787, 37.56995305],
            [55.71051774, 37.56988063],
            [55.71049313, 37.56984777],
            [55.71044998, 37.56982028],
            [55.71042385, 37.56978943],
            [55.71039357, 37.56970427],
            [55.71029589, 37.56940454],
            [55.71020882, 37.56914302],
            [55.71009221, 37.56878629],
            [55.7099794, 37.56843626],
            [55.70993169, 37.5682941],
            [55.70987188, 37.5681097],
            [55.70966441, 37.56750017],
            [55.70953039, 37.56710722],
            [55.70948799, 37.56689801],
            [55.70919912, 37.56690136],

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline);
                    },
                });
                return items;
            },
        }
    );

    // Обозначение начала маршрута
    var startPoint = new ymaps.Placemark(
        [55.70801509, 37.56007626],
        {
            hintContent: "Начало экотропы",
            //   balloonContent: `Начало маршрута`,
        },
        {
            iconLayout: "default#image",
            iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
            iconImageSize: [32, 51],
            iconImageOffset: [-10, -45],
        }
    );

    var endPoint = new ymaps.Placemark(
        [55.70801509, 37.56007626],
        {
            hintContent: "Конец экотропы",
            ////balloonContent: "Это конец маршрута",
        },
        {
            iconLayout: "default#image",
            iconImageHref: "2",
            iconImageSize: [15, 15],
            iconImageOffset: [0, 0],
        }
    );

    // Добавляем линию и маркер на карту.
    myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);

});

//Геолокация пользователя//
function init() {
    var geolocation = ymaps.geolocation,
        myMap = new ymaps.Map(
            "map",
            {
                center: [55, 34],
                zoom: 10,
            },
            {
                searchControlProvider: "yandex#search",
            }
        );

    // Сравним положение, вычисленное по ip пользователя и
    // положение, вычисленное средствами браузера.
    geolocation
        .get({
            provider: "yandex",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Красным цветом пометим положение, вычисленное через ip.
            result.geoObjects.options.set("preset", "islands#redCircleIcon");
            result.geoObjects.get(0).properties.set({
                balloonContentBody: "Мое местоположение",
            });
            myMap.geoObjects.add(result.geoObjects);
        });

    geolocation
        .get({
            provider: "browser",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Синим цветом пометим положение, полученное через браузер.
            // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
            result.geoObjects.options.set("preset", "islands#blueCircleIcon");
            myMap.geoObjects.add(result.geoObjects);
        });
}
