ymaps.ready(function () {
    var myMap = new ymaps.Map("map", {
        zoom: 16,
        center: [55.708492, 37.565603],
        controls: [],
    });
    myMap.controls.add("geolocationControl", {
        float: "none",
        position: {
            top: "16px",
            left: "16px",
        },
    });
    myMap.controls.add("zoomControl", {
        float: "none",
        position: {
            top: "250px",
            right: "15px",
        },
    });
    myMap.controls.add("typeSelector", {
        float: "none",
        position: {
            top: "16px",
            left: "64px",
        },
    });

    // Трэк  

    var myPolyline = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [55.7080540883192, 37.5600836318051],
            [55.7080389441555, 37.5613442700421],
            [55.708131323456, 37.5620631020581],
            [55.7081691837642, 37.5622991364514],
            [55.7082085584457, 37.5624278824841],
            [55.7082343034082, 37.5627363365208],
            [55.7082282457652, 37.5629938285863],
            [55.7082418754465, 37.5637207072293],
            [55.7082570195249, 37.5641176741634],
            [55.7084084600475, 37.5643510263478],
            [55.708425118469, 37.5644019883191],
            [55.7084614640911, 37.5646836202656],
            [55.7085250688481, 37.5649089258229],
            [55.7085705007538, 37.5653890412366],
            [55.7085864018958, 37.5654413443123],
            [55.7087749436603, 37.5658021014249],
            [55.7089135099104, 37.5662071149861],
            [55.7091149222712, 37.5666979592358],
            [55.7092004843335, 37.5669078420912],
            [55.7092587875844, 37.5671800863062],
            [55.7093250411733, 37.5674892108951],
            [55.7094053025141, 37.5678573440824],
            [55.7095166080642, 37.5683723282133],
            [55.7095768037873, 37.5686472546373],
            [55.7096828086003, 37.5690549504076],
            [55.7097872987945, 37.5694009553705],
            [55.70989936043, 37.5697362314973],
            [55.7100083930566, 37.56986497753],
            [55.7101325687385, 37.5699454438004],
            [55.7101098537043, 37.5701439272675],
            [55.710224943074, 37.57076351755],
            [55.7103476037317, 37.5714206587586],
            [55.7104293772928, 37.5717934858117],
            [55.7104581494246, 37.5719141852173],
            [55.7105353797951, 37.5721743594918],
            [55.7108170422002, 37.5721421729836],
            [55.7109470484239, 37.5719968906009],
            [55.7110530495157, 37.5718761911952],
            [55.7110651639085, 37.5718305936419],
            [55.7110636496096, 37.5717930427157],
            [55.7108925334548, 37.5711814990603],
            [55.7106048143234, 37.5701220264994],
            [55.7105578704748, 37.5699530473315],
            [55.7105139552103, 37.569869898852],
            [55.7104526251639, 37.5698189368808],
            [55.7104238530218, 37.5697894325816],
            [55.7103935665334, 37.5697076252066],
            [55.7102958924478, 37.5694045355879],
            [55.7102088184376, 37.569143020209],
            [55.7100922146835, 37.56878628641],
            [55.7099793964329, 37.5684362581336],
            [55.7099316946519, 37.5682941010558],
            [55.7098688493672, 37.5681076875293],
            [55.7096644121904, 37.5675001671874],
            [55.7095303916783, 37.5671072235667],
            [55.7094864752414, 37.566899352368],
            [55.7091991242977, 37.5669000229202],

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline);
                    },
                });
                return items;
            },
        }
    );

    // Обозначение начала маршрута
    var startPoint = new ymaps.Placemark(
        [55.7080540883192, 37.5600836318051],
        {
            hintContent: "Начало экотропы",
            //   balloonContent: `Начало маршрута`,
        },
        {
            iconLayout: "default#image",
            iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
            iconImageSize: [32, 51],
            iconImageOffset: [-10, -45],
        }
    );

    var endPoint = new ymaps.Placemark(
        [55.7080540883192, 37.5600836318051],
        {
            hintContent: "Конец экотропы",
            ////balloonContent: "Это конец маршрута",
        },
        {
            iconLayout: "default#image",
            iconImageHref: "2",
            iconImageSize: [15, 15],
            iconImageOffset: [0, 0],
        }
    );

    // Добавляем линию и маркер на карту.
    myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);

});

//Геолокация пользователя//
function init() {
    var geolocation = ymaps.geolocation,
        myMap = new ymaps.Map(
            "map",
            {
                center: [55, 34],
                zoom: 10,
            },
            {
                searchControlProvider: "yandex#search",
            }
        );

    // Сравним положение, вычисленное по ip пользователя и
    // положение, вычисленное средствами браузера.
    geolocation
        .get({
            provider: "yandex",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Красным цветом пометим положение, вычисленное через ip.
            result.geoObjects.options.set("preset", "islands#redCircleIcon");
            result.geoObjects.get(0).properties.set({
                balloonContentBody: "Мое местоположение",
            });
            myMap.geoObjects.add(result.geoObjects);
        });

    geolocation
        .get({
            provider: "browser",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Синим цветом пометим положение, полученное через браузер.
            // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
            result.geoObjects.options.set("preset", "islands#blueCircleIcon");
            myMap.geoObjects.add(result.geoObjects);
        });
}
