ymaps.ready(function () {
    var myMap = new ymaps.Map("map", {
        zoom: 16,
        center: [55.616798, 37.773896],
        controls: [],
    });
    myMap.controls.add("geolocationControl", {
        float: "none",
        position: {
            top: "16px",
            left: "16px",
        },
    });
    myMap.controls.add("zoomControl", {
        float: "none",
        position: {
            top: "250px",
            right: "15px",
        },
    });
    myMap.controls.add("typeSelector", {
        float: "none",
        position: {
            top: "16px",
            left: "64px",
        },
    });

    // Трэк  

    var myPolyline = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [55.6165332834293, 37.7726360540156],
            [55.6162630826641, 37.7727165202861],
            [55.6161112836548, 37.7727621178393],
            [55.6159685920537, 37.7728238086467],
            [55.6157484816462, 37.7729954700236],
            [55.6156665091468, 37.7731429915194],
            [55.6154539871296, 37.7732475976709],
            [55.6152566442023, 37.7732207755808],
            [55.6152315967617, 37.7732087056402],
            [55.6151002871831, 37.7730410675768],
            [55.6149287491511, 37.7728895227674],
            [55.6148019926858, 37.7727098147634],
            [55.6147040787321, 37.7725140135053],
            [55.6146281762673, 37.7723048012022],
            [55.6145947791387, 37.7722176294092],
            [55.6145074910541, 37.7720258514646],
            [55.614405022184, 37.7718515078786],
            [55.6146228630896, 37.7718112747434],
            [55.6148816829599, 37.7716267875279],
            [55.6149090076846, 37.7716254464234],
            [55.6151579654005, 37.7717099360074],
            [55.6151769407715, 37.7717193237389],
            [55.6151883259897, 37.7717448047245],
            [55.6153021779828, 37.7720760575378],
            [55.6153993314201, 37.7725816539372],
            [55.615513182804, 37.7728941312874],
            [55.6155230499083, 37.7729075423324],
            [55.6155397480792, 37.7729209533775],
            [55.6157541671259, 37.7729906908118],
            [55.6159678259957, 37.7732273957574],
            [55.6162554856571, 37.7733963749253],
            [55.6165029168091, 37.7735666951978],
            [55.6166911455908, 37.7738536915623],
            [55.6167738748919, 37.7739582977139],
            [55.6169021429051, 37.7739100179516],
            [55.6170296515182, 37.7737718841874],
            [55.6171662674338, 37.7737665197693],
            [55.6173552519895, 37.7738241872631],
            [55.6175677636203, 37.774180921062],
            [55.617643660364, 37.774545701488],
            [55.6176178554877, 37.7752403936229],
            [55.6176284810271, 37.7753476819835],
            [55.6179517996217, 37.7757178268275],
            [55.6179943013983, 37.7757366022906],
            [55.6181825229892, 37.7756910047373],
            [55.6183479750952, 37.7757419667086],
            [55.6184694073873, 37.7758358440241],
            [55.6185058370013, 37.7758412084422],
            [55.6185908392833, 37.7757875642617],
            [55.6186621803569, 37.7756829581102],
            [55.618732003409, 37.7755971274217],
            [55.6187471823169, 37.7755434832414],
            [55.6187836116716, 37.7753181776842],
            [55.6187881653386, 37.7752001604875],
            [55.6187912011162, 37.7750472745736],
            [55.6187851295607, 37.7748219690164],
            [55.6187547717686, 37.7746690831026],
            [55.6186940561136, 37.774564476951],
            [55.6186394119433, 37.7745322904428],
            [55.6185361949686, 37.7744250020822],
            [55.6184587820585, 37.7742747983774],

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline);
                    },
                });
                return items;
            },
        }
    );

    // Обозначение начала маршрута
    var startPoint = new ymaps.Placemark(
        [55.6165332834293, 37.7726360540156],
        {
            hintContent: "Начало экотропы",
            //   balloonContent: `Начало маршрута`,
        },
        {
            iconLayout: "default#image",
            iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
            iconImageSize: [32, 51],
            iconImageOffset: [-10, -45],
        }
    );

    var endPoint = new ymaps.Placemark(
        [55.6184587820585, 37.7742747983774],
        {
            hintContent: "Конец экотропы",
            ////balloonContent: "Это конец маршрута",
        },
        {
            iconLayout: "default#image",
            iconImageHref: "2",
            iconImageSize: [15, 15],
            iconImageOffset: [0, 0],
        }
    );

    // Добавляем линию и маркер на карту.
    myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);

});

//Геолокация пользователя//
function init() {
    var geolocation = ymaps.geolocation,
        myMap = new ymaps.Map(
            "map",
            {
                center: [55, 34],
                zoom: 10,
            },
            {
                searchControlProvider: "yandex#search",
            }
        );

    // Сравним положение, вычисленное по ip пользователя и
    // положение, вычисленное средствами браузера.
    geolocation
        .get({
            provider: "yandex",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Красным цветом пометим положение, вычисленное через ip.
            result.geoObjects.options.set("preset", "islands#redCircleIcon");
            result.geoObjects.get(0).properties.set({
                balloonContentBody: "Мое местоположение",
            });
            myMap.geoObjects.add(result.geoObjects);
        });

    geolocation
        .get({
            provider: "browser",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Синим цветом пометим положение, полученное через браузер.
            // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
            result.geoObjects.options.set("preset", "islands#blueCircleIcon");
            myMap.geoObjects.add(result.geoObjects);
        });
}
