ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 15,
    center: [43.615341451048934, 40.320407789028614],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  // Каменный столб

  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
        [43.61821772905557, 40.316277187145694],
      [43.618061836779916, 40.31638983992432],
      [43.617894252129624, 40.316518585957034],
      [43.61753569734458, 40.31707112101408],
      [43.61712647457847, 40.31765047816131],
      [43.616771812579216, 40.31803671625944],
      [43.61666658278959, 40.31819228438231],
      [43.61662371134066, 40.318283479488834],
      [43.61644443040248, 40.318916480816334],
      [43.616105354112875, 40.31984452513549],
      [43.61595725122129, 40.32011274603698],
      [43.61590658435827, 40.32014493254517],
      [43.61561427469361, 40.3201717546353],
      [43.6154817605076, 40.32024685648772],
      [43.6153960158776, 40.320311229504085],
      [43.615341451048934, 40.320407789028614],
      [43.61508421618512, 40.32185081747863],
      [43.61497898342144, 40.32201711443755],
      [43.61453856280573, 40.32235507277344],
      [43.614331992725326, 40.32263402251099],
      [43.61423455376013, 40.322993438518964],
      [43.614242348883195, 40.323385041035145],
      [43.61428132448326, 40.323814194477535],
      [43.61433589028062, 40.324152152813404],
      [43.614355378053325, 40.32441500929688],
      [43.61428522204188, 40.325450341976605],
      [43.61421506594801, 40.326035063541866],
      [43.61417219273896, 40.32697383669707],
      [43.61406695836808, 40.327569287098385],
      [43.61389546492187, 40.32803062704896],
      [43.61372007338794, 40.32837394980285],
      [43.613353698299576, 40.32888356951569],
      [43.61289377745361, 40.32964531687592],
      [43.61268330402069, 40.33018712309692],
      [43.612570271685755, 40.3304714372525],
      [43.6123636947967, 40.3308684041867],
      [43.61223507108971, 40.33117954043244],
      [43.61232471794505, 40.33123318461273],
      [43.612472829846, 40.33118490485047],
      [43.61263653204599, 40.33104542998168],
      [43.61276125723048, 40.33105615881775],
      [43.612983423320145, 40.331029336727596],
      [43.61324456486005, 40.3309381416211],
      [43.61326015536362, 40.33100787905546],
    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
         strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 2,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [43.61821772905557, 40.316277187145694],
    {
      hintContent: "Начало экотропы",
    //   balloonContent: `Начало маршрута Каменный столб `,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [43.61326015536362, 40.33100787905546],
    {
      hintContent: "Конец экотропы",
    //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
