ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 14,
    center: [43.11647713180365, 43.14838930518987],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.

      [43.11647713180365, 43.14838930518987],
      [43.116525273105765, 43.148119743183855],
      [43.11651741330394, 43.14807682783962],
      [43.11643586780005, 43.14798160941959],
      [43.116259021752875, 43.14793869407535],
      [43.116238389680525, 43.14792125971675],
      [43.116071367884395, 43.1475470915592],
      [43.1158075568343, 43.14718283516195],
      [43.11570046568198, 43.1469763050678],
      [43.11557961947611, 43.14663834673191],
      [43.11544092055935, 43.14640292611723],
      [43.11493132631965, 43.14575155037909],
      [43.11423179183689, 43.14488574189381],
      [43.11404314919205, 43.144633614246416],
      [43.11385057588802, 43.14453705472189],
      [43.113724813400836, 43.144488774959626],
      [43.11369337273838, 43.14444049519734],
      [43.11365014180093, 43.144290291492524],
      [43.113654071887424, 43.14407571477132],
      [43.11355668190003, 43.143856314227065],
      [43.11343091880458, 43.143716839358305],
      [43.11325406401122, 43.14338424544044],
      [43.11309685931834, 43.14335205893228],
      [43.112790308997425, 43.143185761973356],
      [43.11257808094623, 43.14311602453897],
      [43.112409084005, 43.143040922686545],
      [43.112279388359234, 43.142890718981704],
      [43.112185064079355, 43.142606404826125],
      [43.112169343351795, 43.14230063299844],
      [43.11211432077337, 43.14215579371163],
      [43.11201606604509, 43.142037776514975],
      [43.11196497352359, 43.141984132334684],
      [43.11193746214808, 43.14191439490029],
      [43.11190209036124, 43.14175882677742],
      [43.111832329276886, 43.141695794865576],
      [43.111759620455835, 43.14167836050697],
      [43.11170656261259, 43.14171591143319],
      [43.11166038260021, 43.14176955561347],
      [43.11147764801672, 43.14189115898904],
      [43.11144424107692, 43.1418965234071],
      [43.111197885188716, 43.14186487755249],
      [43.1110229890245, 43.14166639408542],
      [43.11101512851093, 43.14160470327806],
      [43.111013163382374, 43.14138207992981],
      [43.11110159410439, 43.14110313019229],
      [43.11133740873402, 43.140818816036685],
    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
        strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 2,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [43.11648695656227, 43.14838930518987],
    {
      hintContent: "Начало экотропы",
    //   balloonContent: `Начало маршрута`,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [43.11133937385209, 43.14081345161866],
    {
      hintContent: "Конец экотропы",
    //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
