ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 16,
    center: [59.999142, 30.027543],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  // Западный котлин

  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
      [59.999131386805,30.0327850036753],
    [59.9988573321695,30.0326777153147],
    [59.9987417986504,30.0325972490443],
    [59.9986370120852,30.0323773079051],
    [59.9985617804998,30.0321090870036],
    [59.9985564068085,30.03146535684],
    [59.9985214777941,30.0311703138484],
    [59.9984811750391,30.0309664659632],
    [59.9984193773858,30.0307679824961],
    [59.998387135077,30.0304729395045],
    [59.9984005693724,30.0301671676768],
    [59.9984731144732,30.0298774891032],
    [59.9985375988732,30.0297058277262],
    [59.9986316383972,30.0295770816935],
    [59.9986800014765,30.0293785982264],
    [59.9986853751476,30.0290942840708],
    [59.9985805883942,30.0285471134318],
    [59.998564467327,30.0283057146205],
    [59.9986128305048,30.028048222555],
    [59.9986907488088,30.0278497390879],
    [59.9986504462608,30.0275600605143],
    [59.9986074568219,30.0274903230799],
    [59.9985564067904,30.0274366788996],
    [59.998489235576,30.027318661703],
    [59.9984677407494,30.0270397119654],
    [59.9984408722078,30.026792948736],
    [59.9983951956368,30.0266320161951],
    [59.9982474180618,30.0263745241297],
    [59.998236670576,30.026251142515],
    [59.9982715998921,30.02607411672],
    [59.9982608524142,30.0259400062693],
    [59.9982017412228,30.025714700712],
    [59.9982151755938,30.0255591325892],
    [59.9982581655441,30.0255001239908],
    [59.9982769736208,30.025355284704],
    [59.9983172766253,30.0252211742533],
    [59.9983333978134,30.0249636821879],
    [59.9984247510633,30.0247061901224],
    [59.99840862992,30.024454062475],
    [59.9984354984788,30.0243253164423],
    [59.9984543064634,30.0241965704096],
    [59.9984354984788,30.0239444427622],
    [59.9984596801712,30.0238854341639],
    [59.9985080435028,30.0238800697458],
    [59.9985644672999,30.0239390783442],
    [59.998843898015,30.023917620672],
    [59.9989728652386,30.0239229850901],
    [59.9990615299123,30.0239229850901],
    [59.9991475075408,30.0238639764917],
    [59.99928453,30.02371914],

    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
         strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [59.999131386805,30.0327850036753],
    {
      hintContent: "Начало маршрута",
    //   balloonContent: `Начало маршрута Каменный столб `,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [59.99928453,30.02371914],
    {
      hintContent: "Конец маршрута",
    //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
