ymaps.ready(function () {
    var myMap = new ymaps.Map("map", {
        zoom: 14,
        center: [52.699731, 41.526342],
        controls: [],
    });
    myMap.controls.add("geolocationControl", {
        float: "none",
        position: {
            top: "16px",
            left: "16px",
        },
    });
    myMap.controls.add("zoomControl", {
        float: "none",
        position: {
            top: "250px",
            right: "15px",
        },
    });
    myMap.controls.add("typeSelector", {
        float: "none",
        position: {
            top: "16px",
            left: "64px",
        },
    });

    // Трэк

    // 1 часть
    var myPolyline1 = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [52.70832606, 41.51374276],
            [52.70668064, 41.51440862],
            [52.70636621, 41.51453426],
            [52.70629127, 41.51456532],
            [52.70625787, 41.51458296],
            [52.70586015, 41.51481563],
            [52.70557667, 41.51498218],
            [52.70532292, 41.51513022],
            [52.70504514, 41.51529315],
            [52.70444212, 41.51564579],
            [52.70417818, 41.51594284],
            [52.70316314, 41.51668716],
            [52.70225562, 41.51735369],
            [52.70189839, 41.5176152],
            [52.70124502, 41.51855934],
            [52.70140592, 41.51922319],
            [52.70176682, 41.52057234],
            [52.70200959, 41.52139779],
            [52.70230429, 41.52197799],
            [52.70231712, 41.52199525],
            [52.70258637, 41.52221117],
            [52.7027214, 41.52232075],
            [52.70280592, 41.52238082],
            [52.70316192, 41.5226316],
            [52.70357535, 41.52302857],
            [52.70374928, 41.52307551],
            [52.70397045, 41.52313184],
            [52.70437043, 41.52319554],
            [52.7056457, 41.52362402],
            [52.70582166, 41.52368236],
            [52.70643627, 41.52363676],
            [52.70672789, 41.52212131],
            [52.7068012, 41.52175251],
            [52.70791064, 41.51810672],
            [52.70799698, 41.51781503],
            [52.70834561, 41.51564244],
            [52.70824786, 41.51378098],

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline1);
                    },
                });
                return items;
            },
        }
    );

    // 2 часть
    var myPolyline2 = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [52.70672585, 41.52213382],
            [52.70682401, 41.52224781],
            [52.70698651, 41.52243423],
            [52.70715594, 41.52262936],
            [52.70719056, 41.52267026],
            [52.70720604, 41.52268099],
            [52.70750578, 41.52278707],
            [52.70808573, 41.52290302],
            [52.70826575, 41.52303043],
            [52.70828367, 41.52304652],
            [52.70829344, 41.523072],
            [52.70837897, 41.52348506],
            [52.7083977, 41.52386325],
            [52.70830566, 41.52496698],
            [52.70801731, 41.52527946],
            [52.70774443, 41.52570727],
            [52.70759537, 41.52616861],
            [52.70752368, 41.52683112],
            [52.7075579, 41.52741986],
            [52.70669201, 41.52741584],
            [52.70629123, 41.52726429],
            [52.70583532, 41.52680333],
            [52.70581658, 41.52675907],
            [52.70565692, 41.52629907],
            [52.70558442, 41.52584444],
            [52.70556976, 41.52559365],
            [52.70561945, 41.52440811],
            [52.70563737, 41.52362089],

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline2);
                    },
                });
                return items;
            },
        }
    );

    // 3 часть
    var myPolyline3 = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [52.70582777, 41.52678516],
            [52.70580577, 41.5270802],
            [52.70576767, 41.52758839],
            [52.70570576, 41.52842993],
            [52.70563509, 41.52902426],
            [52.70559558, 41.52934277],
            [52.70558214, 41.52938502],
            [52.70540496, 41.52964452],
            [52.70538134, 41.52966129],
            [52.70516737, 41.52969809],
            [52.70472952, 41.52967998],
            [52.70471526, 41.52968199],
            [52.70469897, 41.52969071],
            [52.70431691, 41.52996094],
            [52.70415765, 41.53004946],
            [52.70381021, 41.53024258],
            [52.70379066, 41.53026202],
            [52.70374056, 41.53034383],
            [52.70345625, 41.53079176],
            [52.70298642, 41.53153377],
            [52.70281494, 41.531804],
            [52.70261372, 41.53205143],
            [52.70243938, 41.53226534],
            [52.70184468, 41.53299691],
            [52.70182716, 41.53304653],
            [52.70180231, 41.53329464],
            [52.70176728, 41.53364869],
            [52.70175914, 41.5336802],
            [52.70174651, 41.53369697],
            [52.70172044, 41.53372044],
            [52.70098356, 41.53431522],
            [52.70041287, 41.53477522],
            [52.7002199, 41.53499676],
            [52.69947272, 41.53585077],
            [52.69945887, 41.5358776],
            [52.69934237, 41.53620483],
            [52.69922378, 41.53654417],
            [52.69890196, 41.53744807],
            [52.69869665, 41.53770959],
            [52.69848238, 41.53797781],
            [52.69845549, 41.53799658],
            [52.69792754, 41.53808241],
            [52.69669237, 41.53805693],
            [52.69595093, 41.5380623],
            [52.69508888, 41.53806766],
            [52.69480126, 41.53807169],
            [52.69438677, 41.53788054],
            [52.69355973, 41.53749967],
            [52.69274, 41.53687739],
            [52.69272086, 41.53686331],
            [52.69270252, 41.53683515],
            [52.69236558, 41.53582262],
            [52.69236029, 41.53579043],
            [52.69233177, 41.53515944],
            [52.6923171, 41.53483355],
            [52.69236558, 41.53459349],
            [52.6925807, 41.53352866],
            [52.69290745, 41.53191665],
            [52.69306798, 41.5311321],
            [52.69324072, 41.53028318],
            [52.69341917, 41.5293994],
            [52.69383717, 41.52923578],
            [52.69386162, 41.52921298],
            [52.69404658, 41.52894476],
            [52.69437984, 41.52846196],
            [52.69462946, 41.52810265],
            [52.69572517, 41.5265221],
            [52.69647884, 41.52543715],
            [52.69712576, 41.52450374],
            [52.69779712, 41.5235301],
            [52.69846521, 41.52256923],
            [52.6992779, 41.52139644],
            [52.69968485, 41.52080971],
            [52.69996839, 41.52040092],
            [52.70029183, 41.51993556],
            [52.7004344, 41.51972769],
            [52.70055945, 41.51954865],
            [52.7007314, 41.51929956],
            [52.70087682, 41.51909102],
            [52.70103527, 41.51886035],
            [52.70124668, 41.51855726],

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline3);
                    },
                });
                return items;
            },
        }
    );

    // 4 часть
    var myPolyline4 = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [52.69171421, 41.53483858],
            [52.69181322, 41.5347903],
            [52.69199167, 41.53477152],
            [52.69210371, 41.53480237],
            [52.69212408, 41.53481712],
            [52.69220679, 41.53491837],
            [52.69224794, 41.53494654],
            [52.69227442, 41.53494922],
            [52.69229724, 41.53492843],
            [52.69230946, 41.53489021],
            [52.69231761, 41.53483187],

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline4);
                    },
                });
                return items;
            },
        }
    );

    // Обозначение начала маршрута
    var startPoint = new ymaps.Placemark(
        [52.70832606, 41.51374276],
        {
            hintContent: "Начало экотропы",
            //   balloonContent: `Начало экотропы`,
        },
        {
            iconLayout: "default#image",
            iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
            iconImageSize: [32, 51],
            iconImageOffset: [-10, -45],
        }
    );

    // Обозначение конца маршрута
    var endPoint = new ymaps.Placemark(
        [52.70824786, 41.51378098],
        {
            hintContent: "Конец экотропы",
            ////balloonContent: "Это конец экотропы",
        },
        {
            iconLayout: "default#image",
            iconImageHref: "2",
            iconImageSize: [15, 15],
            iconImageOffset: [0, 0],
        }
    );

    // Добавляем линии на карту.
    myMap.geoObjects.add(myPolyline1).add(myPolyline2).add(myPolyline3).add(myPolyline4).add(startPoint).add(endPoint);

});

//Геолокация пользователя//
function init() {
    var geolocation = ymaps.geolocation,
        myMap = new ymaps.Map(
            "map",
            {
                center: [55, 34],
                zoom: 10,
            },
            {
                searchControlProvider: "yandex#search",
            }
        );

    // Сравним положение, вычисленное по ip пользователя и
    // положение, вычисленное средствами браузера.
    geolocation
        .get({
            provider: "yandex",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Красным цветом пометим положение, вычисленное через ip.
            result.geoObjects.options.set("preset", "islands#redCircleIcon");
            result.geoObjects.get(0).properties.set({
                balloonContentBody: "Мое местоположение",
            });
            myMap.geoObjects.add(result.geoObjects);
        });

    geolocation
        .get({
            provider: "browser",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Синим цветом пометим положение, полученное через браузер.
            // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
            result.geoObjects.options.set("preset", "islands#blueCircleIcon");
            myMap.geoObjects.add(result.geoObjects);
        });
}
