ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 14,
    center: [60.16792512310169, 30.533956837345933],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  // Токсовские высоты
  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.

      [60.1679460496032,30.5340693038021],
[60.1668514315289,30.5291939987275],
[60.1667765840859,30.5286790145966],
[60.1667872765882,30.5280996574494],
[60.1668193540742,30.5275632156464],
[60.1668621240068,30.5270696891876],
[60.1661350275571,30.52496683732],
[60.1659639436934,30.5245805992218],
[60.1657500876071,30.5244947685333],
[60.1655790017325,30.5247522605988],
[60.1652876606208,30.5249771172789],
[60.1650844931766,30.5251487786558],
[60.1649027107108,30.5255779320982],
[60.1648171656719,30.5257495934751],
[60.1646033020971,30.5254706437376],
[60.1642611174727,30.5252131516722],
[60.1638761554969,30.5250629479673],
[60.1636622857774,30.5249127442625],
[60.1635446568364,30.5245050484922],
[60.1635553503939,30.5240329797056],
[60.1637371403381,30.5236681992796],
[60.1639937832473,30.5232605035093],
[60.164346663964,30.5227240617063],
[60.1645391427524,30.5221447045591],
[60.1647850862247,30.5218872124937],
[60.1651593444869,30.5217155511167],
[60.1654908268046,30.5218228394773],
[60.1656298345201,30.5226167733458],
[60.1658971553914,30.5221661622312],
[60.1660254686346,30.5220803315428],
[60.1661003177943,30.5221447045591],
[60.1664317905881,30.523389249542],
[60.1667204899653,30.5243548447874],
[60.1667739525336,30.5245265061644],
[60.1672230346618,30.5234321648863],
[60.1675224193261,30.5231746728208],
[60.1677576482136,30.5227669770506],
[60.1680249517166,30.5225524003294],
[60.1683991729552,30.5226167733458],
[60.168805465458,30.5228742654112],
[60.1691369108715,30.5230673844603],
[60.1694362780387,30.5235179955748],
[60.169590666198,30.5242399640139],
[60.1697327789603,30.5247631437612],
[60.169379956277,30.5246987707449],
[60.1690485133237,30.5248489744497],
[60.1687491426113,30.5251708395315],
[60.168449769162,30.5255356199575],
[60.1682145452461,30.525986231072],
[60.1680541643347,30.5264368421865],
[60.1680007038563,30.5269303686453],
[60.1680648564199,30.5275311834646],
[60.1678189375771,30.5280032522512],
[60.1676478625103,30.5283036596609],
[60.1675789038243,30.5287802111699],
[60.1676856185165,30.5295845877552],
[60.1678032325853,30.5303141486072],
[60.1679315383605,30.5310651671314],
[60.1679101540996,30.5317947279835],
[60.1678139247525,30.5323311697864],
[60.1677497716974,30.5327603232288],
    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
         strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 2,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [60.16794650735289, 30.5340212103623],
    {
      hintContent: "Начало экотропы",
    //   balloonContent: `Начало маршрута`,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [60.16794650735289, 30.5340212103623],
    {
      hintContent: "Конец экотропы",
    //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
