ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 15,
    center: [51.886000, 39.658582],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });

  // Трэк

  // 1 часть
  var myPolyline1 = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
      [51.87944765, 39.65599258],
      [51.87989254, 39.65581019],
      [51.88015814, 39.65559562],
      [51.88084206, 39.65459783],
      [51.88100141, 39.65440472],
      [51.88172515, 39.65448518],
      [51.88313277, 39.65451737],
      [51.88437435, 39.65372343],
      [51.8853802, 39.65394338],
      [51.88602088, 39.65432961],
      [51.8869238, 39.65414186],
      [51.88706986, 39.65412577],
      [51.88771051, 39.65441544],
      [51.88841423, 39.65457638],
      [51.88910134, 39.65493043],
      [51.88959592, 39.6547695],
      [51.89000751, 39.65430279],
      [51.89054523, 39.65383072],
      [51.8908174, 39.65375026],
      [51.89109622, 39.65381999],
      [51.89125886, 39.65443154],
      [51.89150116, 39.65498944],
      [51.89204882, 39.65563317],
      [51.89251017, 39.65596576],
      [51.89270268, 39.65628226],
      [51.89283876, 39.65667386],
      [51.89278897, 39.65719421],
      [51.89267281, 39.65767165],
      [51.89246039, 39.65775748],
      [51.89193265, 39.65774138],
      [51.89134516, 39.65760727],
      [51.89068796, 39.65736051],
      [51.88968886, 39.65663095],
      [51.88931378, 39.65649684],
      [51.88899512, 39.6565022],
      [51.88865323, 39.65662022],
      [51.88838104, 39.65686698],
      [51.88802254, 39.65744634],
      [51.88781674, 39.65750535],
      [51.88770055, 39.65750535],
      [51.88714288, 39.65733905],
      [51.88656197, 39.65716203],
      [51.88596113, 39.65721567],
      [51.88511795, 39.65640564],
      [51.88464656, 39.6565183],
      [51.88449386, 39.6566685],
      [51.88435775, 39.65673287],
      [51.88359753, 39.65648074],
      [51.88260492, 39.6564271],
      [51.88292694, 39.65723713],
      [51.88305309, 39.65783794],
      [51.88311949, 39.65797742],
      [51.88346806, 39.65839584],
      [51.88355438, 39.65854068],
      [51.88368053, 39.65895374],
      [51.88370708, 39.65911467],
      [51.8837436, 39.65938826],
      [51.88375024, 39.65972622],
      [51.88370708, 39.66035922],
      [51.88364069, 39.6605577],
      [51.88362077, 39.66109414],
      [51.88352782, 39.66148038],
      [51.88353114, 39.66177543],
      [51.88351454, 39.66186126],
      [51.88336183, 39.66241916],
      [51.88320912, 39.66283758],
      [51.88303981, 39.66313262],
      [51.88288378, 39.66333647],
      [51.88266467, 39.66347595],
      [51.88256176, 39.66364224],
      [51.88247544, 39.66384609],
      [51.88239245, 39.66409285],
      [51.88226297, 39.6641304],
      [51.88215342, 39.66430207],
      [51.8820671, 39.66436107],
      [51.88188119, 39.6647795],
      [51.88178491, 39.66488679],
      [51.88163884, 39.6646293],
      [51.88148944, 39.664463],
      [51.88135997, 39.6643879],
      [51.88123049, 39.66423769],
      [51.88112093, 39.66417868],
      [51.88108441, 39.66408749],
      [51.88110433, 39.66370662],
      [51.88110433, 39.66356714],
      [51.88119729, 39.66292878],
      [51.88127033, 39.6627142],
      [51.88127365, 39.66257472],
      [51.88129357, 39.66241379],
      [51.88127365, 39.66219921],
      [51.88120061, 39.66203828],
      [51.88102465, 39.66196318],
      [51.8808653, 39.6619149],
      [51.8808653, 39.66148575],
      [51.88091177, 39.66124435],
      [51.88088522, 39.66106196],
      [51.8808985, 39.66085275],
      [51.8808985, 39.66065963],
      [51.88086862, 39.66052015],
      [51.8807657, 39.66032167],
      [51.88070926, 39.65989788],
      [51.88062626, 39.65956529],
      [51.88052666, 39.6593668],
      [51.88048018, 39.65932925],
      [51.88032082, 39.6592005],
      [51.88014486, 39.6589752],
      [51.88006518, 39.65888937],
      [51.87990582, 39.65880354],
      [51.8797033, 39.65844412],
      [51.87951073, 39.6582671],
      [51.87944765, 39.65809007],
      [51.87943769, 39.65789695],
      [51.87950077, 39.65771456],
      [51.87957382, 39.65751071],
      [51.87954394, 39.6573015],
      [51.87944101, 39.6570762],
      [51.87940449, 39.65687235],
      [51.87932149, 39.65674897],

    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
      strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline1);
          },
        });
        return items;
      },
    }
  );

  // 2 часть
  var myPolyline2 = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
      [51.88140291, 39.65444897],
      [51.88150749, 39.65484862],
      [51.88163282, 39.6553046],
      [51.88167681, 39.65539579],
      [51.88171498, 39.65545882],
      [51.88184861, 39.65561976],
      [51.88201294, 39.65582092],
      [51.88205278, 39.65589871],
      [51.88212582, 39.65610926],
      [51.88215653, 39.65617631],
      [51.88219554, 39.65623398],
      [51.88222956, 39.6562769],
      [51.88231837, 39.6562997],
      [51.88246444, 39.65633322],
      [51.88258147, 39.65639894],
      [51.88260637, 39.6564271],

    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
      strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline2);
          },
        });
        return items;
      },
    }
  );

  // Обозначение начала маршрута
  var startPoint = new ymaps.Placemark(
    [51.87932149, 39.65674897],
    {
      hintContent: "Начало экотропы",
      //   balloonContent: `Начало экотропы`,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  // Обозначение конца маршрута
  var endPoint = new ymaps.Placemark(
    [51.87944765, 39.65599258],
    {
      hintContent: "Конец экотропы",
      ////balloonContent: "Это конец экотропы",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );

  // Добавляем линии на карту.
  myMap.geoObjects.add(myPolyline1).add(myPolyline2).add(startPoint).add(endPoint);

});

//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
