ymaps.ready(function () {
    var myMap = new ymaps.Map("map", {
        zoom: 15,
        center: [55.874830, 37.616950],
        controls: [],
    });
    myMap.controls.add("geolocationControl", {
        float: "none",
        position: {
            top: "16px",
            left: "16px",
        },
    });
    myMap.controls.add("zoomControl", {
        float: "none",
        position: {
            top: "250px",
            right: "15px",
        },
    });
    myMap.controls.add("typeSelector", {
        float: "none",
        position: {
            top: "16px",
            left: "64px",
        },
    });

    // Трэк  

    var myPolyline = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [55.87064362, 37.62383037],
            [55.87066473, 37.62376868],
            [55.87074768, 37.62374186],
            [55.87076728, 37.62369894],
            [55.87082157, 37.62339317],
            [55.87083816, 37.62336635],
            [55.87123629, 37.62305253],
            [55.87150171, 37.6227253],
            [55.87162688, 37.62238198],
            [55.87165553, 37.62234174],
            [55.87184554, 37.62217276],
            [55.87214413, 37.62166851],
            [55.87217278, 37.62159072],
            [55.87226176, 37.62115889],
            [55.8722693, 37.62106501],
            [55.87227835, 37.62063318],
            [55.8724201, 37.62029522],
            [55.87266138, 37.61967294],
            [55.87289964, 37.61927061],
            [55.873533, 37.61861079],
            [55.87372602, 37.61839085],
            [55.87390094, 37.61826747],
            [55.87403062, 37.61812263],
            [55.87415427, 37.6181119],
            [55.87422816, 37.61833989],
            [55.87449054, 37.61824869],
            [55.87453427, 37.6179456],
            [55.87454935, 37.6179],
            [55.87465039, 37.61767738],
            [55.87488713, 37.61689954],
            [55.87501238, 37.61679897],
            [55.8750908, 37.61671314],
            [55.87516167, 37.61660585],
            [55.87534412, 37.6162813],
            [55.87547079, 37.61587093],
            [55.87569245, 37.61598626],
            [55.87596978, 37.6161354],
            [55.87606478, 37.61623464],
            [55.87609795, 37.61624269],
            [55.87634072, 37.61621319],
            [55.87660459, 37.616181],
            [55.8767207, 37.61613808],
            [55.87686093, 37.61601202],
            [55.87698909, 37.61576257],
            [55.87704941, 37.61565529],
            [55.8771067, 37.61556141],
            [55.87713837, 37.61554263],
            [55.87717456, 37.61556141],
            [55.87723789, 37.61566601],
            [55.87724542, 37.61570625],
            [55.8772409, 37.61575989],
            [55.87722884, 37.61606298],
            [55.87724241, 37.61612735],
            [55.87729518, 37.61622928],
            [55.87732685, 37.61626415],
            [55.87748064, 37.61629365],
            [55.87792092, 37.61616759],
            [55.87810638, 37.61611126],
            [55.87825565, 37.61604957],
            [55.8783039, 37.61605494],
            [55.8784004, 37.61609785],
            [55.87863411, 37.6160308],
            [55.87881202, 37.61606835],
            [55.87882559, 37.6161354],
            [55.87901105, 37.61614613],
            [55.87927792, 37.61622391],
            [55.8795478, 37.61640899],
            [55.87968048, 37.61667453],
            [55.87971818, 37.61708222],
            [55.87965485, 37.61729143],
            [55.87949352, 37.61735312],
            [55.87925078, 37.61728875],
            [55.87906382, 37.61713587],
            [55.87892812, 37.61692129],
            [55.87887987, 37.61640094],
            [55.87882408, 37.61612735]
        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline);
                    },
                });
                return items;
            },
        }
    );

    // Обозначение начала маршрута
    var startPoint = new ymaps.Placemark(
        [55.87064362,37.62383037],
        {
            hintContent: "Начало экотропы",
            //   balloonContent: `Начало маршрута`,
        },
        {
            iconLayout: "default#image",
            iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
            iconImageSize: [32, 51],
            iconImageOffset: [-10, -45],
        }
    );

    var endPoint = new ymaps.Placemark(
        [55.87882408,37.61612735],
        {
            hintContent: "Конец экотропы",
            ////balloonContent: "Это конец маршрута",
        },
        {
            iconLayout: "default#image",
            iconImageHref: "2",
            iconImageSize: [15, 15],
            iconImageOffset: [0, 0],
        }
    );

    // Добавляем линию и маркер на карту.
    myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);

});

//Геолокация пользователя//
function init() {
    var geolocation = ymaps.geolocation,
        myMap = new ymaps.Map(
            "map",
            {
                center: [55, 34],
                zoom: 10,
            },
            {
                searchControlProvider: "yandex#search",
            }
        );

    // Сравним положение, вычисленное по ip пользователя и
    // положение, вычисленное средствами браузера.
    geolocation
        .get({
            provider: "yandex",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Красным цветом пометим положение, вычисленное через ip.
            result.geoObjects.options.set("preset", "islands#redCircleIcon");
            result.geoObjects.get(0).properties.set({
                balloonContentBody: "Мое местоположение",
            });
            myMap.geoObjects.add(result.geoObjects);
        });

    geolocation
        .get({
            provider: "browser",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Синим цветом пометим положение, полученное через браузер.
            // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
            result.geoObjects.options.set("preset", "islands#blueCircleIcon");
            myMap.geoObjects.add(result.geoObjects);
        });
}
