ymaps.ready(function () {
    var myMap = new ymaps.Map("map", {
        zoom: 16,
        center: [56.347087, 43.914666],
        controls: [],
    });
    myMap.controls.add("geolocationControl", {
        float: "none",
        position: {
            top: "16px",
            left: "16px",
        },
    });
    myMap.controls.add("zoomControl", {
        float: "none",
        position: {
            top: "250px",
            right: "15px",
        },
    });
    myMap.controls.add("typeSelector", {
        float: "none",
        position: {
            top: "16px",
            left: "64px",
        },
    });

    // Трэк

    // 1 часть
    var myPolyline1 = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [56.3447826465889, 43.9159021799857],
            [56.3448362700265, 43.9159155910308],
            [56.3448869143147, 43.9159129088218],
            [56.3448988306011, 43.9159263198668],
            [56.3449040439782, 43.9159826462562],
            [56.3448988306011, 43.91604031375],
            [56.344837014789, 43.9161476021106],
            [56.3448139269297, 43.9161771064097],
            [56.3448042449201, 43.9162159984405],
            [56.3447982867591, 43.9162522082622],
            [56.3448306292839, 43.9163863162072],
            [56.3448462694412, 43.9165083567174],
            [56.344874570662, 43.9166411260636],
            [56.3449200015249, 43.9167859653505],
            [56.3449766038355, 43.9169442156823],
            [56.3450138421517, 43.9170059064897],
            [56.345138962613, 43.9168677727254],
            [56.3454026079795, 43.9165968696149],
            [56.3457839223279, 43.9161999026807],
            [56.3460401157538, 43.9159182707341],
            [56.3462084279338, 43.9157492915662],
            [56.3463931236347, 43.9156768719227],
            [56.3465048343084, 43.915545443681],
            [56.3466016499529, 43.915365735677],
            [56.3467744280408, 43.9151511589558],
            [56.3471050873627, 43.9147810141118],
            [56.3474068483791, 43.9144504228427],
            [56.3476823934265, 43.914150015433],
            [56.3482290093007, 43.9135545650317],
            [56.3485745498801, 43.9131817379787],
            [56.3487279569778, 43.913058356364],
            [56.3488262563387, 43.9129725256754],
            [56.3491180369012, 43.9128395593463],
            [56.3494561226053, 43.9127081311045],
            [56.3495529307349, 43.9126518047152],
            [56.3494963352429, 43.9125659740268],
            [56.349401016329, 43.9124720967112],
            [56.3492773992563, 43.912423816949],
            [56.3490510151403, 43.9123943126498],
            [56.3488618642124, 43.9124077236948],
            [56.3487725012449, 43.9124533212481],
            [56.3486831380602, 43.9125391519365],
            [56.3485193050218, 43.9126759445963],
            [56.3482899375738, 43.9129092967806],
            [56.3481767427348, 43.9129937863646],
            [56.3480635475725, 43.9130460894404],
            [56.3479533308715, 43.9130729115304],
            [56.3479235425266, 43.9119839346704],
            [56.3478818387974, 43.9105972326097],
            [56.3478565186581, 43.9105328595933],
            [56.3478177937064, 43.9104979908762],
            [56.3477701321732, 43.9104899442491],
            [56.3476733194998, 43.9105060375032],
            [56.347631615496, 43.9100661552247],
            [56.3476286366373, 43.9100071466264],
            [56.347631615496, 43.9096316373643],
            [56.3476420414926, 43.9094412005242],

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline1);
                    },
                });
                return items;
            },
        }
    );

    // 2 часть
    var myPolyline2 = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [56.3465025878426, 43.9155453887016],
            [56.3465565812203, 43.9152751561433],
            [56.3466519072652, 43.9150967892438],
            [56.3467152095824, 43.9149593260318],
            [56.34675468039, 43.9148600842983],
            [56.3468075563132, 43.9147709008485],
            [56.346809045747, 43.9146066155463],
            [56.3468529848367, 43.9143410768539],
            [56.3469147973684, 43.9140755381614],
            [56.3469051158942, 43.9139360632926],
            [56.3469282024825, 43.9137764718562],
            [56.3469803334368, 43.913635655883],
            [56.3471424103512, 43.9134209918554],
            [56.3471506023065, 43.9133391844805],
            [56.347245182149, 43.9131930040892],
            [56.3472943337833, 43.9131286310728],
            [56.3473621033533, 43.9130857157286],
            [56.3474194467475, 43.9130803513106],
            [56.3474328516905, 43.9130508470114],
            [56.3474358305575, 43.9129676985319],
            [56.3474671087207, 43.9128443169172],
            [56.3475117917663, 43.9127960371549],
            [56.3475356227024, 43.9126994776304],
            [56.3475624324877, 43.9125358628805],
            [56.3475669007834, 43.9124205278929],
            [56.3475430698669, 43.9123159217413],
            [56.3475251966627, 43.9122059511717],
            [56.3475237072292, 43.9121281671102],
            [56.3475371121215, 43.9120316075857],
            [56.3475773267908, 43.911905543762],
            [56.347662224286, 43.9116829204137],
            [56.3477098859546, 43.9113503264959],
            [56.3477188225039, 43.9111598896558],
            [56.3477232907812, 43.9109828638608],
            [56.3477128648, 43.9108568000371],
            [56.3476935022559, 43.9107361006315],
            [56.347677118557, 43.9105107950742],

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline2);
                    },
                });
                return items;
            },
        }
    );

    // Обозначение начала маршрута
    var startPoint = new ymaps.Placemark(
        [56.3447826465889, 43.9159021799857],
        {
            hintContent: "Начало маршрута",
            //   balloonContent: `Начало маршрута`,
        },
        {
            iconLayout: "default#image",
            iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
            iconImageSize: [32, 51],
            iconImageOffset: [-10, -45],
        }
    );

    // Добавляем линии на карту.
    myMap.geoObjects.add(myPolyline1).add(myPolyline2).add(startPoint);

});

//Геолокация пользователя//
function init() {
    var geolocation = ymaps.geolocation,
        myMap = new ymaps.Map(
            "map",
            {
                center: [55, 34],
                zoom: 10,
            },
            {
                searchControlProvider: "yandex#search",
            }
        );

    // Сравним положение, вычисленное по ip пользователя и
    // положение, вычисленное средствами браузера.
    geolocation
        .get({
            provider: "yandex",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Красным цветом пометим положение, вычисленное через ip.
            result.geoObjects.options.set("preset", "islands#redCircleIcon");
            result.geoObjects.get(0).properties.set({
                balloonContentBody: "Мое местоположение",
            });
            myMap.geoObjects.add(result.geoObjects);
        });

    geolocation
        .get({
            provider: "browser",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Синим цветом пометим положение, полученное через браузер.
            // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
            result.geoObjects.options.set("preset", "islands#blueCircleIcon");
            myMap.geoObjects.add(result.geoObjects);
        });
}
