ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 14,
    center: [60.617154, 29.331409],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });

  // Трэк

  // 1 часть
  var myPolyline1 = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
      [60.6096313377694,29.3455313962171],
[60.6097341767231,29.3452631753156],
[60.6098185571575,29.345161251373],
[60.6102167243458,29.3448179286191],
[60.6105305082511,29.3443887751767],
[60.6110921474376,29.3435251038739],
[60.6113373671093,29.3431656878659],
[60.6114982090955,29.3429028313824],
[60.6115667644555,29.3426667969891],
[60.6120993818818,29.3426828902432],
[60.6124289674615,29.3427794497677],
[60.6127242732631,29.3427472632595],
[60.6128771984119,29.3425058644481],
[60.6129879368654,29.3423342030712],
[60.6131725001072,29.3421410840221],
[60.6136286304242,29.341770939178],
[60.6140056581133,29.341406158752],
[60.6147306989567,29.3406712334819],
[60.615439904904,29.3398772996135],
[60.6159355488439,29.3393140357203],
[60.6160120038794,29.3390619080729],
[60.616054185881,29.338718585319],
[60.6160410040086,29.3384020846553],
[60.6159856400855,29.3380158465571],
[60.6162569282106,29.3377236016946],
[60.6164085183903,29.3375224360184],
[60.6168342852541,29.3371066936211],
[60.6172633418066,29.336826402779],
[60.6175889200891,29.3365206309513],
[60.6179975359433,29.3359546848492],
[60.6183679219562,29.3352385350422],
[60.6189610579267,29.3341093250469],
[60.6196741246918,29.3330659457401],
[60.6204833901834,29.3313412853435],
[60.6206863623497,29.3307431527332],
[60.6208642914654,29.3301906176761],
[60.6211753355453,29.3286483474925],
[60.621560717843,29.3268217631442],
[60.6216865828829,29.3262598403556],
[60.6219099756696,29.325349230395],
[60.6222486862397,29.3246706315142],
[60.6227692655634,29.3239249774081],
[60.6229616800889,29.3236621209246],
[60.6232489818395,29.3229647465808],
[60.6234150358,29.3222029992205],
[60.6234967445813,29.3214680739504],
[60.6235099233884,29.320861894713],
[60.6236127179606,29.3198748417955],
[60.623768227087,29.3194617816072],
[60.6239290069183,29.3191828318697],
[60.6241214145029,29.3190004416567],
[60.6247935141746,29.3187805005174],
[60.6249503353981,29.3187724538904],
[60.625167775348,29.3186785765748],
[60.6253549043052,29.3184425421815],
[60.6255367609806,29.3179382868867],
[60.6256448202569,29.31743939601],
[60.6256764472935,29.3168546744447],
[60.6256474558445,29.3163879700761],
[60.6255262185837,29.3157174178224],
[60.6253522686756,29.3150254078965],
[60.6252415727952,29.3144621440034],
[60.6252363015533,29.3141241856675],
[60.625281107082,29.3138291426759],
[60.625455057357,29.3130673953156],
[60.6255393965499,29.3126167842011],
[60.6256474558174,29.3120910712342],
[60.6256448202298,29.3118013926606],
[60.6256105575717,29.3115653582673],
[60.6255051337795,29.3112917729478],
[60.6251150627328,29.3107231446366],
[60.6248119637173,29.3102993556122],
[60.6242004857196,29.3095215149979],
[60.6233939495297,29.3085398264984],
[60.6227534504923,29.3077190705399],
[60.6220628569882,29.3068607636551],

    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
      strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline1);
          },
        });
        return items;
      },
    }
  );

  // 2 часть
  var myPolyline2 = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
      [60.6127269098103,29.3427506160206],
[60.6128119415542,29.3427975546783],
[60.6128798349466,29.3428719859785],
[60.6130146325678,29.3430818688339],
[60.6131728295568,29.3428807031578],
[60.6136447793017,29.3442674052184],
[60.6139176632811,29.3450640212958],

    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
      strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline2);
          },
        });
        return items;
      },
    }
  );

  // 3 часть
  var myPolyline3 = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
      [60.6128116118837,29.3433420431083],
[60.6132084237198,29.3428270589774],
[60.6132334714788,29.3425856601661],
[60.613228198268,29.342387176699],
[60.6131728295025,29.3421404134696],

    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
      strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline3);
          },
        });
        return items;
      },
    }
  );

  // 4 часть
  var myPolyline4 = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
      [60.6222719760735,29.3453390444203],
[60.6218410093885,29.3442715252323],
[60.6214525222226,29.3433382689063],
[60.6213510386953,29.3431263743941],
[60.6212015393853,29.3428610580454],
[60.6209142193382,29.3423541205416],
[60.6206757411871,29.3419044530825],
[60.6204108225919,29.3414323842959],
[60.6200918629702,29.3408583915667],
[60.6196595490142,29.3404158270792],
[60.6194644786138,29.3402227080301],
[60.6190456504765,29.3397947456214],
[60.6186527890788,29.3393870565531],
[60.6183483110433,29.3390678736803],
[60.6182718615622,29.3389874074099],
[60.6182125471844,29.3388854834673],
[60.6178645672886,29.3381639692423],
[60.6172595478294,29.3368282291528],

    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
      strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline4);
          },
        });
        return items;
      },
    }
  );

  // 5 часть
  var myPolyline5 = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
      [60.6115714689192,29.3426492017263],
[60.6115965179439,29.3424694937223],
[60.6116136567453,29.3422012728208],
[60.6116400241141,29.3419598740094],
[60.6116835302254,29.3417748015874],
[60.6117507668181,29.3415816825384],
[60.6120012548816,29.341160575723],
[60.6124613568119,29.340452472543],
[60.6127276592162,29.3400099080556],
[60.6133868140953,29.3393018048756],
[60.6138824896768,29.3388190072529],
[60.6140459554838,29.3387278121464],
[60.6142278761307,29.3387009900563],
[60.6145653493795,29.3386956256382],
[60.6148711814607,29.3386634391301],
[60.6151401003615,29.3385990661137],
[60.6153826527435,29.338470320081],
[60.6159916620655,29.3380036157124],

    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
      strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline5);
          },
        });
        return items;
      },
    }
  );  

  // Обозначение начала маршрута
  var startPoint = new ymaps.Placemark(
    [60.6096313377694,29.3455313962171],
    {
      hintContent: "Начало экотропы",
      //   balloonContent: `Начало экотропы`,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  // Обозначение конца маршрута
  var endPoint = new ymaps.Placemark(
    [60.6220628569882,29.3068607636551],
    {
      hintContent: "Конец экотропы",
      ////balloonContent: "Это конец экотропы",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );

  // Добавляем линии на карту.
  myMap.geoObjects.add(myPolyline1).add(myPolyline2).add(myPolyline3).add(myPolyline4).add(myPolyline5).add(startPoint).add(endPoint);

});

//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
