ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 15,
    center: [60.02814415536325, 29.67453128584379],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  // Западный котлин

  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
        [60.026807155822844, 29.675434768065582],
       [60.02669440481048, 29.67527383552469],
       [60.02661655269571, 29.67519336925424],
       [60.02630782698037, 29.67501634345927],
       [60.02562862021956, 29.67451208816446],
       [60.02522055250504, 29.674592554434906],
       [60.02518028239071, 29.67468374954143],
       [60.02510779606081, 29.674968063697005],
       [60.024970877002424, 29.675225555762427],
       [60.024691667746964, 29.67490369068064],
       [60.024728652835975, 29.67450230026406],
       [60.024962222016526, 29.673472332002326],
       [60.02509656207744, 29.673102735601244],
       [60.02478513740553, 29.6727486840113],
       [60.024495187650125, 29.672625302396614],
       [60.02445223191375, 29.672662853322826],
       [60.02388306311744, 29.673966406904054],
       [60.02383742179744, 29.6740468731745],
       [60.02350987635115, 29.673843025289372],
       [60.023850845721654, 29.67404419096549],
       [60.02446162848586, 29.67267626436789],
       [60.02454351278665, 29.672625302396614],
       [60.02452069259212, 29.672373174749197],
       [60.02443209639299, 29.672155915819],
       [60.024422699812455, 29.672099589429695],
       [60.02443478112981, 29.672032534204316],
       [60.02454082805869, 29.6718876949175],
       [60.02460526146897, 29.67183941515524],
       [60.02468043362163, 29.67167311819632],
       [60.024783795051434, 29.671225189290833],
       [60.02481869624016, 29.671174227319558],
       [60.024989174592164, 29.671115218721216],
       [60.02502407556327, 29.67118495615561],
       [60.0250603188403, 29.671273469053098],
       [60.025381577005476, 29.671919041325726],
       [60.02588417473703, 29.67218654348904],
       [60.02592981322081, 29.672224094415252],
       [60.02607209749966, 29.67235284044796],
       [60.02631639548805, 29.672492315316724],
       [60.02669760411354, 29.672771265054273],
       [60.026896260380724, 29.672615696931434],
       [60.027111022564874, 29.672604968095353],
       [60.02744658567385, 29.67220263674312],
       [60.027653290847184, 29.671676923776204],
       [60.02779556768017, 29.67139797403865],
       [60.027846572432885, 29.67144088938289],
       [60.027859994723094, 29.671623279595913],
       [60.02792979054405, 29.672014882112094],
       [60.02800227066306, 29.672476222062645],
       [60.0280264306673, 29.672717620873986],
       [60.028098910573625, 29.673162867570454],
       [60.028184812478244, 29.673447181726033],
       [60.028278767429875, 29.6742518444305],
       [60.02829218954393, 29.67440204813534],
       [60.02814415536325, 29.67453128584379],
       [60.02805020002757, 29.674745862564976],
       [60.02799651114399, 29.674922888359973],
       [60.02779517705093, 29.675099914154945],
       [60.02772806541306, 29.675035541138605],
       [60.02763410889025, 29.675019447884498],
       [60.02747572443075, 29.674997990212393],
       [60.02731465470767, 29.674922888359973],
       [60.027158953226504, 29.674826328835422],
       [60.02707304864593, 29.674756591401053],
       [60.027019358169284, 29.674643938622424],
     
    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
         strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [60.027019358169284, 29.674643938622424],
    {
      hintContent: "Начало экотропы",
    //   balloonContent: `Начало маршрута Каменный столб `,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [60.026807155822844, 29.675434768065582],
    {
      hintContent: "Конец экотропы",
    //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
