ymaps.ready(function () {
    var myMap = new ymaps.Map("map", {
        zoom: 17,
        center: [56.716286, 38.829318],
        controls: [],
    });
    myMap.controls.add("geolocationControl", {
        float: "none",
        position: {
            top: "16px",
            left: "16px",
        },
    });
    myMap.controls.add("zoomControl", {
        float: "none",
        position: {
            top: "250px",
            right: "15px",
        },
    });
    myMap.controls.add("typeSelector", {
        float: "none",
        position: {
            top: "16px",
            left: "64px",
        },
    });

    // Трэк  

    var myPolyline = new ymaps.Polyline(
        [
            // Указываем координаты вершин.
            [56.7168443420214, 38.8297225056264],
            [56.7167669085049, 38.8295461503837],
            [56.7167481032017, 38.8295481620404],
            [56.7167281893818, 38.8295615657784],
            [56.7167079061838, 38.8295635828978],
            [56.7166850509575, 38.8295407887873],
            [56.7166666058347, 38.8295139599737],
            [56.7166526038669, 38.8294871407893],
            [56.7166319495195, 38.8294650141518],
            [56.7166183122622, 38.8294609862089],
            [56.7166057683219, 38.8294737262728],
            [56.7165895470074, 38.8294723876958],
            [56.7165766402841, 38.8293476695146],
            [56.7165519425433, 38.8293107884189],
            [56.7165364515014, 38.8292752483401],
            [56.7165272253199, 38.8292423898981],
            [56.7165253852976, 38.8292242877599],
            [56.7165305486859, 38.8291679556337],
            [56.7165419791567, 38.8291263796282],
            [56.7165284475431, 38.829104188647],
            [56.716511493902, 38.8290807186546],
            [56.7164768318293, 38.8290592555576],
            [56.7164451225921, 38.829042497231],
            [56.7164123007827, 38.8290263966437],
            [56.7163621492608, 38.8289419102677],
            [56.716353672623, 38.8289264918968],
            [56.7163308117782, 38.8289177739296],
            [56.7162721831133, 38.8288983293595],
            [56.7162401018498, 38.8287353765586],
            [56.7162221039231, 38.8287037423138],
            [56.7162044044426, 38.8286554610516],
            [56.7161822700054, 38.8286118737865],
            [56.7161682576677, 38.8285944387623],
            [56.7161516690054, 38.8285662664624],
            [56.7161339681223, 38.8285280485476],
            [56.7160886051547, 38.8285173207418],
            [56.7160701757647, 38.8284556268931],
            [56.7160377347593, 38.8283537147367],
            [56.7160211361795, 38.8283134682824],
            [56.7160060183469, 38.8282517821583],
            [56.7160012231682, 38.828214895302],
            [56.7159706249441, 38.8281672892954],
            [56.7159488572197, 38.828288657837],
            [56.7159112471893, 38.828323528158],
            [56.7158581503321, 38.8283570592942],
            [56.7158301315375, 38.8283865723454],
            [56.7158375001613, 38.828426800796],
            [56.7158824873346, 38.8284965437655],
            [56.7158692090307, 38.828585048805],
            [56.7159252645071, 38.8287593942545],
            [56.7159591943094, 38.8288291282682],
            [56.7160100714322, 38.8288117033207],
            [56.7160307203121, 38.8288854627862],
            [56.716108889108, 38.8290651588028],
            [56.7161258647616, 38.8291134392445],
            [56.7161678936772, 38.829121490436],
            [56.716189281803, 38.829140269391],
            [56.716209192258, 38.8292448681358],
            [56.7162202462244, 38.8293803238656],
            [56.716216574199, 38.829432627399],
            [56.7162482803078, 38.8295050459724],
            [56.7162844144862, 38.8295425976566],
            [56.7163537359734, 38.8295828286366],
            [56.7163972532904, 38.8296820710778],
            [56.7164186279722, 38.8297625425154],
            [56.7164208532481, 38.8298282538113],
            [56.7164355934313, 38.8298966464131],
            [56.716479836983, 38.8299502881231],
            [56.7165203972537, 38.829912736439],
            [56.7166037364982, 38.8297933818453],
            [56.7166642076366, 38.8297303498313],
            [56.7167040349147, 38.8296954804263],
            [56.7167460663826, 38.8296753744533],
            [56.7167910504586, 38.8296941413465],
            [56.7168408320081, 38.8297142579607]

        ],
        [],

        {
            // Задаем опции геообъекта.
            // Цвет с прозрачностью.
            strokeColor: "#F28123",
            // Ширину линии.
            strokeWidth: 3,
            // Максимально допустимое количество вершин в ломаной.
            editorMaxPoints: 6,
            // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
            editorMenuManager: function (items) {
                items.push({
                    title: "Удалить линию",
                    onClick: function () {
                        myMap.geoObjects.remove(myPolyline);
                    },
                });
                return items;
            },
        }
    );

    // Обозначение начала маршрута
    var startPoint = new ymaps.Placemark(
        [56.7168443420214, 38.8297225056264],
        {
            hintContent: "Начало экотропы",
            //   balloonContent: `Начало маршрута`,
        },
        {
            iconLayout: "default#image",
            iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
            iconImageSize: [32, 51],
            iconImageOffset: [-10, -45],
        }
    );

    var endPoint = new ymaps.Placemark(
        [56.7168408320081, 38.8297142579607],
        {
            hintContent: "Конец экотропы",
            ////balloonContent: "Это конец маршрута",
        },
        {
            iconLayout: "default#image",
            iconImageHref: "2",
            iconImageSize: [15, 15],
            iconImageOffset: [0, 0],
        }
    );

    // Добавляем линию и маркер на карту.
    myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);

});

//Геолокация пользователя//
function init() {
    var geolocation = ymaps.geolocation,
        myMap = new ymaps.Map(
            "map",
            {
                center: [55, 34],
                zoom: 10,
            },
            {
                searchControlProvider: "yandex#search",
            }
        );

    // Сравним положение, вычисленное по ip пользователя и
    // положение, вычисленное средствами браузера.
    geolocation
        .get({
            provider: "yandex",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Красным цветом пометим положение, вычисленное через ip.
            result.geoObjects.options.set("preset", "islands#redCircleIcon");
            result.geoObjects.get(0).properties.set({
                balloonContentBody: "Мое местоположение",
            });
            myMap.geoObjects.add(result.geoObjects);
        });

    geolocation
        .get({
            provider: "browser",
            mapStateAutoApply: true,
        })
        .then(function (result) {
            // Синим цветом пометим положение, полученное через браузер.
            // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
            result.geoObjects.options.set("preset", "islands#blueCircleIcon");
            myMap.geoObjects.add(result.geoObjects);
        });
}
