ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 17,
    center: [55.83383904699007, 37.613389041944814],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.

      [55.83383904699007, 37.613389041944814],
      [55.83389338954267, 37.61325359038959],
      [55.83396961993935, 37.61312886767038],
      [55.83413705266413, 37.61304013023897],
      [55.83417026175532, 37.61299721489473],
      [55.83419818755997, 37.61290870199724],
      [55.834205735071286, 37.612770568232975],
      [55.83418762104168, 37.61264316330479],
      [55.83417026175532, 37.61256269703434],
      [55.83410157928524, 37.61246211419628],
      [55.834064596366275, 37.61242053995654],
      [55.834042708499645, 37.61240578780695],
      [55.833939307031365, 37.61239103565737],
      [55.83387364318188, 37.61234946141765],
      [55.83383091568284, 37.6122694654701],
      [55.83374789217387, 37.61221582128981],
      [55.833692039894984, 37.61204281880834],
      [55.8336226018143, 37.611962352537894],
      [55.83359543035752, 37.611871157431395],
      [55.83361432724608, 37.61179203176221],
      [55.83360602485676, 37.61175582194051],
      [55.83358036291488, 37.61172497653685],
      [55.83354726236607, 37.61152386026556],
      [55.833548771893824, 37.61145412283116],
      [55.83356235764097, 37.61136292772466],
      [55.83357594338333, 37.61100351171667],
      [55.833550281421516, 37.61093243317778],
      [55.83349097161835, 37.610879322079725],
      [55.833446440458395, 37.610879322079725],
      [55.83335964228758, 37.610924919633],
      [55.83330378944872, 37.61092089631947],
      [55.83324675436799, 37.61100138302778],
      [55.833218827877204, 37.61104698058103],
      [55.83318800063268, 37.61118007542508],
      [55.83317592429649, 37.611220308560306],
      [55.83310044711002, 37.61135307790655],
      [55.83308610642795, 37.611409404295856],
      [55.8330627084616, 37.61169505955595],
      [55.833018656300794, 37.61182594607349],
      [55.83301186333245, 37.61191714117999],
      [55.83301639197815, 37.61213976452824],
      [55.83298695577166, 37.61226046393391],
      [55.83297110549736, 37.61247235844608],
      [55.83299299396969, 37.612649384241074],
      [55.832982474494756, 37.61278220688199],
      [55.8329115255892, 37.61290558849667],
      [55.83284812432958, 37.61295655046795],
      [55.83280887587875, 37.61297532593107],
      [55.83265942949032, 37.61297532593107],
      [55.83253444849195, 37.61300561002512],
      [55.832496709291966, 37.612989516771044],
      [55.832404625489666, 37.612892957246515],
    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
         strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 2,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [55.83383980174827, 37.613395747467365],
    {
      hintContent: "Начало маршрута",
    //   balloonContent: `Начало маршрута`,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [55.832402928275506, 37.612892266370395],
    {
      hintContent: "Конец маршрута",
    //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
