ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 15,
    center: [60.18118245428622, 29.790235612377046],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  // Западный котлин

  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.
      [60.17964698255261, 29.800178045172267],
       [60.17983469531133, 29.800088191170264],
       [60.1798654239878, 29.800021135944906],
       [60.17997230611607, 29.79968854202704],
       [60.18013129263616, 29.799291575092834],
       [60.180236837882646, 29.798822188515246],
       [60.180262222131674, 29.79854860319572],
       [60.180235501868985, 29.798355484146644],
       [60.180124612545804, 29.797738576073225],
       [60.18020450595732, 29.797404490379645],
       [60.1802445863811, 29.79719527807646],
       [60.180265962587065, 29.796910963920887],
       [60.18025794651147, 29.796739302543937],
       [60.18022321016121, 29.796599827675177],
       [60.18016175345117, 29.796476446060492],
       [60.18023389827289, 29.79630478468352],
       [60.18033810717904, 29.796208225158995],
       [60.18053583598642, 29.796288691429442],
       [60.18060530798653, 29.79630478468352],
       [60.18069348377426, 29.79615994539673],
       [60.18072287565077, 29.79589708891326],
       [60.18067477983915, 29.795596681503604],
       [60.1805946199961, 29.794995866684264],
       [60.1805839320022, 29.794899307159714],
       [60.18059729199405, 29.794657908348373],
       [60.18064004393127, 29.794432602791137],
       [60.180677451830526, 29.794336043266586],
       [60.180795019235646, 29.793821059135748],
       [60.18112634328705, 29.79213663187439],
       [60.18115039086992, 29.791991792587574],
       [60.18115039086992, 29.791841588882733],
       [60.181086263943044, 29.791353426842026],
       [60.181104967643, 29.791074477104477],
       [60.18120650182786, 29.790857884868487],
       [60.18122787740559, 29.79047164677036],
       [60.18118245428622, 29.790235612377046],
       [60.18113435914998, 29.79018733261478],
       [60.180637371936825, 29.789865467532994],
       [60.18120432472167, 29.786867608721483],
       [60.181968493004824, 29.78744696586869],
       [60.1819952118527, 29.786953439409956],
       [60.18209139952461, 29.78612731903336],
       [60.18219827438401, 29.785590877230387],
       [60.18247080369586, 29.784850587542287],
       [60.18263111399569, 29.783970822985395],
       [60.182887608842094, 29.783756246264215],
       [60.18301051191032, 29.783670415575713],
       [60.18364105082808, 29.783970822985395],
       [60.18300049265571, 29.783694555456858],
       [60.18293369754678, 29.783349891598448],
       [60.1828401841652, 29.783105810578093],
       [60.18202861038194, 29.782492925818183],
       [60.179347136945346, 29.78059863780274],
       [60.17933377644322, 29.78056108687653],
       [60.179345800895376, 29.7804135653807],
       [60.179483413755534, 29.779898581249864],
       [60.17955689611384, 29.77958744500413],
       [60.179548879864576, 29.779557940704958],
       [60.179488757932624, 29.779482838852537],
       [60.17837639245536, 29.78353885405908],
       [60.17830691572434, 29.783903634485107],
       [60.17809848464648, 29.785319840844966],
       [60.17746249443656, 29.78978303664575],
       [60.17704256698016, 29.792587121580727],
     
    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
         strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 3,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [60.17964698255261, 29.800178045172267],
    {
      hintContent: "Начало маршрута",
    //   balloonContent: `Начало маршрута Каменный столб `,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [60.17704256698016, 29.792587121580727],
    {
      hintContent: "Конец маршрута",
    //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
