ymaps.ready(function () {
  var myMap = new ymaps.Map("map", {
    zoom: 14,
    center: [59.70248632223368, 30.119334067809042],
    controls: [],
  });
  myMap.controls.add("geolocationControl", {
    float: "none",
    position: {
      top: "16px",
      left: "16px",
    },
  });
  myMap.controls.add("zoomControl", {
    float: "none",
    position: {
      top: "250px",
      right: "15px",
    },
  });
  myMap.controls.add("typeSelector", {
    float: "none",
    position: {
      top: "16px",
      left: "64px",
    },
  });
  var myPolyline = new ymaps.Polyline(
    [
      // Указываем координаты вершин.

      [59.70248632223368, 30.119334067809042],
      [59.702375173585445, 30.12053033302969],
      [59.70240499399082, 30.12073418091482],
      [59.702611025154376, 30.12110432575887],
      [59.70269235289504, 30.12146374176687],
      [59.702646267199675, 30.122965778815203],
      [59.70278723500856, 30.123008694159463],
      [59.70273301669101, 30.12333055924125],
      [59.70274928219553, 30.12400111149496],
      [59.70273572760897, 30.12431761215872],
      [59.70265163071282, 30.124828762606597],
      [59.702518795138424, 30.125483221606252],
      [59.70240222470887, 30.126051849917406],
      [59.702356138612735, 30.12647027452372],
      [59.702333190920406, 30.126953814475268],
      [59.70238740988773, 30.127624366729002],
      [59.70246602723378, 30.128665063826784],
      [59.70231692521305, 30.129233692137937],
      [59.70228439377453, 30.129405353514883],
      [59.70225457326134, 30.13005981251454],
      [59.7022708389991, 30.13074109360432],
      [59.70225186230427, 30.131685231177553],
      [59.70207631451687, 30.131639616299083],
      [59.7017997942841, 30.131521599102427],
      [59.70161815719781, 30.1316986248974],
      [59.70131452284545, 30.132776872921394],
      [59.70108408421587, 30.133533255863597],
      [59.701048840520436, 30.133662001896308],
      [59.70089702109915, 30.133898036289622],
      [59.70079138989985, 30.134131573109574],
      [59.700650413658046, 30.134319327740627],
      [59.70047961472098, 30.13430323448652],
      [59.700410041884716, 30.135253065082512],
      [59.70000066224183, 30.13547300622172],
      [59.699976261972054, 30.1353067092628],
      [59.69987323841406, 30.13516723439404],
      [59.699832571132546, 30.134931200000725],
      [59.69987323841406, 30.134571783992726],
      [59.69989492761059, 30.134485953304253],
      [59.69978919264431, 30.133879774066887],
      [59.69955381785817, 30.13381416138623],
      [59.69951315018736, 30.13339037236189],
      [59.69942787232307, 30.132853170057356],
      [59.69933569185014, 30.132445474287096],
      [59.69913506288168, 30.13159789623839],
      [59.69911066197893, 30.130900521894525],
      [59.69877446994655, 30.129843731542664],
      [59.69873651256878, 30.1297096210919],
      [59.69847894350778, 30.129377027174062],
      [59.697820099915354, 30.12817003311736],
      [59.697685834882115, 30.12842254240091],
      [59.697813267063204, 30.128921433277693],
      [59.697355051204795, 30.129447146244612],
      [59.697248833988695, 30.129576966676453],
      [59.697172915719136, 30.129753992471425],
      [59.69720274077421, 30.129957840356557],
      [59.69718376119679, 30.130311891946526],
      [59.69721900897482, 30.13060157052013],
      [59.69719189530272, 30.130848333749523],
      [59.69724341126088, 30.13170664063428],
      [59.69728950441919, 30.132098243150462],
      [59.69730034985894, 30.132495210084645],
      [59.69739223701556, 30.132648162375123],
      [59.69747628882277, 30.132363848219548],
      [59.6974085051238, 30.13268034888331],
      [59.697804359979884, 30.133334807882935],
      [59.697874854187695, 30.13352792693201],
      [59.69726209186414, 30.13243895007197],
      [59.69708043007489, 30.13230483962123],
      [59.696950283707416, 30.132095627318073],
      [59.696912324254605, 30.131961516867314],
      [59.696863519180425, 30.131650380621604],
      [59.6967442175875, 30.131215862761184],
      [59.69665474111288, 30.13092081976953],
      [59.69642969316168, 30.130303911696114],
      [59.695798168758415, 30.128711668525167],
      [59.69546736636947, 30.127649513755276],
      [59.695465374392754, 30.12706999004316],
      [59.69520506855273, 30.126233140830532],
      [59.695123722561355, 30.126222411994455],
      [59.695077626411546, 30.126141945724008],
      [59.6949067989483, 30.12495104492141],
      [59.69478477879632, 30.124656001929754],
      [59.6946031035212, 30.124387781028283],
      [59.6943581817257, 30.12441679102073],
      [59.69424293858836, 30.12423708301672],
      [59.69407617428502, 30.123432420312252],
      [59.69400702786609, 30.123250030099253],
      [59.692734472617154, 30.12349096270578],
      [59.69239279282866, 30.123533878050015],
    ],
    [],

    {
      // Задаем опции геообъекта.
      // Цвет с прозрачностью.
      strokeColor: "#F28123",
      // Ширину линии.
      strokeWidth: 2,
      // Максимально допустимое количество вершин в ломаной.
      editorMaxPoints: 6,
      // Добавляем в контекстное меню новый пункт, позволяющий удалить ломаную.
      editorMenuManager: function (items) {
        items.push({
          title: "Удалить линию",
          onClick: function () {
            myMap.geoObjects.remove(myPolyline);
          },
        });
        return items;
      },
    }
  );
  var startPoint = new ymaps.Placemark(
    [59.70248632223368, 30.119334067809042],
    {
      hintContent: "Начало маршрута",
    //   balloonContent: `Начало маршрута Дудергофские Высоты`,
    },
    {
      iconLayout: "default#image",
      iconImageHref: "https://i.ibb.co/Z2wRNPF/map-marker.png",
      iconImageSize: [32, 51],
      iconImageOffset: [-10, -45],
    }
  );

  var endPoint = new ymaps.Placemark(
    [59.69239279282866, 30.123533878050015],
    {
      hintContent: "Конец маршрута",
    //   balloonContent: "Это конец маршрута",
    },
    {
      iconLayout: "default#image",
      iconImageHref: "2",
      iconImageSize: [15, 15],
      iconImageOffset: [0, 0],
    }
  );
  // Добавляем линию на карту.
  myMap.geoObjects.add(myPolyline).add(startPoint).add(endPoint);
});
//Геолокация пользователя//
function init() {
  var geolocation = ymaps.geolocation,
    myMap = new ymaps.Map(
      "map",
      {
        center: [55, 34],
        zoom: 10,
      },
      {
        searchControlProvider: "yandex#search",
      }
    );

  // Сравним положение, вычисленное по ip пользователя и
  // положение, вычисленное средствами браузера.
  geolocation
    .get({
      provider: "yandex",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Красным цветом пометим положение, вычисленное через ip.
      result.geoObjects.options.set("preset", "islands#redCircleIcon");
      result.geoObjects.get(0).properties.set({
        balloonContentBody: "Мое местоположение",
      });
      myMap.geoObjects.add(result.geoObjects);
    });

  geolocation
    .get({
      provider: "browser",
      mapStateAutoApply: true,
    })
    .then(function (result) {
      // Синим цветом пометим положение, полученное через браузер.
      // Если браузер не поддерживает эту функциональность, метка не будет добавлена на карту.
      result.geoObjects.options.set("preset", "islands#blueCircleIcon");
      myMap.geoObjects.add(result.geoObjects);
    });
}
